console.log(`
    1. Task: https://github.com/rolling-scopes-school/tasks/blob/master/tasks/library/library-part1.md;
    \n
    2. Deploy: https://rolling-scopes-school.github.io/ranika23-JSFEPRESCHOOL2023Q2/library/;
    \n
    3. Done 29.07.2023 / deadline 30.07.2023;
    \n
    4. Score : 100 / 100;
    \n
    - (10/10) Вёрстка валидная; 
    \n
    В коде страницы присутствуют следующие элементы (может быть больше):
    \n
    - (2/2) 'header', 'main', 'footer'; 
    \n
    - (2/2) шесть элементов 'section';
    \n
    - (2/2) только один заголовок 'h1';
    \n
    - (2/2) шесть заголовков 'h2';
    \n
    - (2/2) oдин элемент 'nav';
    \n
    - (2/2) два списка ul > li > a (панель навигации, ссылки на соцсети в футере);
    \n
    - (2/2) 19 кнопок 'button';
    \n
    - (2/2) 6 инпутов 'input';
    \n
    - (8/8) Блок 'Header'. Текст совпадает с макетом. Элементы меню работают как якоря. Элементы меню при наведении (эффект hover) интерактивные. Расстояние от самого меню до иконки пользователя - 40px. Иконка является отдльным элементом, и не входит в 'nav'. Текст 'Brooklyn Public Library' находится в 'h1';
    \n
    - (4/4) Секция 'Welcome'; 
    \n
    - (6/6) Секция 'About'. Добавлены все картинки, которые будут использованы, в папку с картинками (5 шт.). Расстояния между кнопками пагинации 10px. Интерактивная область кнопок (область нажатия, выделяемая cursor:pointer) размером +5px в каждую сторону (квадратная); 
    \n
    - (8/8) Секция 'Favorites'. Интерактивные кнопки имеют структуру input type='radio' + label. Добавлена небольшая область вокруг кнопки и надписи. Картинки и описания для 4 секций добавлены в проект на страницу и скрыты. Кнопки 'buy' интерактивные, плавно меняют свой цвет при наведении на них, как указано в макете styleguides. Кнопка 'own' не интерактивная, с атрибутом disabled;
    \n
    - (6/6) Секция 'CoffeShop'; 
    \n
    - (6/6) Секция 'Contacts'. Карта вставлена картинкой. Текст с цифрами в виде телефонных номеров является ссылками с типом 'tel' и номерами. Текст с именем контактного лица является ссылкой с типом 'mailto' и адресом почты; 
    \n
    - (8/8) Секция 'LibraryCard': 'Find your Library card' является формой с полями input. Все кнопки интерактивные, плавно меняют свой цвет при наведении на них. Иконки из модального окна (Visits, Bonuses, Books) добавлены в соответствующую папку проекта;
    \n
    - (8/8) Блок 'Footer': Адрес библиотеки является ссылкой (место на карте). Иконки соцсетей являются ссылками (на аккаунты этих сервисов). Вместо Username указано моё имя на английском языке и ссылка на GitHub;
    \n
    Общие требования к верстке:
    \n
    - (2/2) Для построения сетки используются флексы (display: flex);
    \n
    - (2/2) При уменьшении масштаба страницы браузера вся вёрстка (контент и фоны) размещается по центру, фон за рамками страницы - серый;
    \n
    - (2/2) Иконки добавлены в формате .svg; 
    \n
    - (2/2) Изображения добавлены в формате .png;
    \n
    - (2/2) Есть favicon;
    \n
    - (2/2) Плавная прокрутка по якорям;
    \n
    - (2/2) В футере название ссылки Username заменено и ведет на GitHub студента;
    \n
    - (2/2) В футере ссылка The Rolling Scopes School ведет на страницу курса https://rs.school/js-stage0/;
    \n
    - (2/2) Интерактивность элементов согласно макету. Интерактивность включает в себя не только изменение внешнего вида курсора, но и другие визуальные эффекты, например, изменение цвета фона или цвета шрифта. Если в макете указаны стили при наведении и клике, для элемента указаны эти стили. Если в макете стили не указаны, реализованы по своему усмотрению;
    \n
    - (2/2) Обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияет на соседние элементы;
`);